export const pendingStatus = {
  0: "กำลังเตรียมพัสดุ",
  1: "จัดส่งเรียบร้อย",
  2: "ยกเลิกการจัดส่ง",
};

export const orderStatus = {
  0: "รอชำระ",
  1: "ชำระไม่สำเร็จ",
  2: "เสร็จสิ้น",
  3: "ยกเลิก",
};

export const confirmStatus = {
  1: "สำเร็จ",
  4: "ยกเลิก",
};

export const checkorderConfirm = (status) => {
  for (const key in orderConfirm) {
    if (key == status) {
      return pendingStatus[key];
    }
  }
};

export const checkOrderStatus = (status) => {
  for (const key in orderStatus) {
    if (key == status) {
      return orderStatus[key];
    }
  }
};

export const checkPadding = (status) => {
  for (const key in pendingStatus) {
    if (key == status) {
      return pendingStatus[key];
    }
  }
};

export const defaultPermission = {
  0: "การเข้าถึงหน้าจัดการรายการสั่งซื้อ",
  1: "การเข้าถึงหน้าประวัติการซื้อขาย",
  2: "การเข้าถึงหน้ารายการสินค้า",
  3: "การเข้าถึงหน้าคูปอง",
  4: "การเข้าถึงหน้าลูกค้า",
  5: "การเข้าถึงหน้าผู้ดูแล",
  6: "การเข้าถึงหน้าสิทธิ์การเข้าถึง",

  7: "เพิ่มข้อมูลคำสั่งซื้อ",
  8: "ลบข้อมูลคำสั่งซื้อ",
  9: "แก้ไขข้อมูลคำสั่งซื้อ",
  10: "เพิ่มข้อมูลสินค้า",
  11: "ลบข้อมูลสินค้า",
  12: "แก้ไขข้อมูลสินค้า",
  13: "เพิ่มข้อมูลคูปอง",
  14: "ลบข้อมูลคูปอง",
  15: "แก้ไขข้อมูลคูปอง",
  16: "เพิ่มข้อมูลลูกค้า",
  17: "ลบข้อมูลลูกค้า",
  18: "แก้ไขข้อมูลลูกค้า",
  19: "เพิ่มข้อมูลผู้ดูแล",
  20: "ลบข้อมูลผู้ดูแล",
  21: "แก้ไขข้อมูลผู้ดูแล",
  22: "เพิ่มตำแหน่งผู้ดูแลระบบ",
  23: "ลบตำแหน่งผู้ดูแลระบบ",
  24: "แก้ไขตำแหน่งผู้ดูแลระบบ",

  25: "ปรับแต่ง Banner",
  26: "ปรับแต่ง Popup",
};
