export const pendingStatus = {
  0: "กำลังเตรียมพัสดุ",
  1: "จัดส่งเรียบร้อย",
  2: "ยกเลิกการจัดส่ง",
};

export const orderStatus = {
  0: "รอชำระ",
  1: "ชำระไม่สำเร็จ",
  2: "เสร็จสิ้น",
  3: "ยกเลิก",
};

export const confirmStatus = {
  1: "สำเร็จ",
  4: "ยกเลิก",
};

export const checkorderConfirm = (status) => {
  for (const key in orderConfirm) {
    if (key == status) {
      return pendingStatus[key];
    }
  }
};

export const checkOrderStatus = (status) => {
  for (const key in orderStatus) {
    if (key == status) {
      return orderStatus[key];
    }
  }
};

export const checkPadding = (status) => {
  for (const key in pendingStatus) {
    if (key == status) {
      return pendingStatus[key];
    }
  }
};

export const defaultPermission = {
  0: "การเข้าถึงหน้าจัดการรายการสั่งซื้อ",
  1: "การเข้าถึงหน้าประวัติการซื้อขาย",
  2: "การเข้าถึงหน้ารายการสินค้า",
  3: "การเข้าถึงหน้าคูปอง",
  4: "การเข้าถึงหน้าโปรโมชั่น",
  5: "การเข้าถึงหน้าลูกค้า",
  6: "การเข้าถึงหน้าผู้ดูแล",
  7: "การเข้าถึงหน้าสิทธิ์การเข้าถึง",
  8: "การเข้าถึงหน้าแบนเนอร์",

  9: "เพิ่มข้อมูลรายการสั่งซื้อ",
  10: "ลบข้อมูลรายการซื้อ",
  11: "แก้ไขข้อมูลรายการซื้อ",

  12: "เพิ่มข้อมูลสินค้า",
  13: "ลบข้อมูลสินค้า",
  14: "แก้ไขข้อมูลสินค้า",

  15: "เพิ่มข้อมูลคูปอง",
  16: "ลบข้อมูลคูปอง",
  17: "แก้ไขข้อมูลคูปอง",

  18: "เพิ่มข้อมูลลูกค้า",
  19: "ลบข้อมูลลูกค้า",
  20: "แก้ไขข้อมูลลูกค้า",

  21: "เพิ่มข้อมูลผู้ดูแล",
  22: "ลบข้อมูลผู้ดูแล",
  23: "แก้ไขข้อมูลผู้ดูแล",

  24: "เพิ่มตำแหน่งผู้ดูแลระบบ",
  25: "ลบตำแหน่งผู้ดูแลระบบ",
  26: "แก้ไขตำแหน่งผู้ดูแลระบบ",

  27: "ปรับแต่ง Banner",
  28: "ปรับแต่ง โปรโมชั่น",
};
